import { NextRequest } from 'next/server';

type Params = {
  params: Promise<{
    storyId: string;
  }>;
};

export async function GET(
  req: NextRequest,
  { params }: Params
) {
  const { storyId } = await params;

  return Response.json({
    _id: storyId,

    title: 'Карпати для новачків: легкі маршрути вихідного дня',

    description:
      'Карпати — це ідеальне місце для тих, хто хоче відкрити для себе світ гірських мандрівок. У цій статті ми розглянемо найпростіші маршрути, які підійдуть навіть новачкам.',

    content: `Карпати – це ідеальне місце для тих, хто тільки починає відкривати для себе світ гірських мандрівок. Тут можна знайти безліч маршрутів, які не потребують спеціальної підготовки чи складного спорядження, але водночас дарують неймовірні враження від природи. Легкі стежки пролягають через зелені пагорби, мальовничі полонини та соснові ліси, де кожен крок наповнює подорож спокоєм і свіжим повітрям.

Одним із популярних напрямків є прогулянки до невеликих вершин, з яких відкриваються панорамні краєвиди на гірські хребти та долини. Такі маршрути займають усього кілька годин і підходять навіть для сімей з дітьми. Подорожуючи вихідного дня, ви зможете насолодитися чарівною тишею лісів, відкрити для себе чисті гірські потоки та відчути особливу атмосферу Карпат без перевтоми.

Легкі маршрути – чудовий спосіб розпочати знайомство з горами, відчути ритм природи та зрозуміти, що мандрівка може бути доступною кожному. Карпати надихають і водночас навчають бережно ставитися до довкілля, адже краса цих місць заслуговує на те, щоб залишатися незмінною для наступних поколінь.`,

    img: '/images/carpathians.jpg',

    author: 'Анастасія Олійник',
    date: '23.07.2025',
    category: 'Маршрути',

    isSaved: false,
  });
}